{
  "coolSoftwareTiles":["_Ninjaneer", "_Wizard", "_Engineer", "_Overlord", "_RockStar", "_Master", "_Codeling", "_Magician", "_Guru", "_Engineer"],
  "aboutMe": "Use this bio section as your way of describing yourself and saying what you do, what technologies you like to use or feel most comfortable with, describing your personality, or whatever else you feel like throwing in.",
  "phoneNumber": "+27768862529",
  "email":"juriespies@gmail.com",
  "github": "https://github.com/JurieSpies",
  "linkedIn": "https://www.linkedin.com/in/juriespies/",
  "resume":"https://drive.google.com/file/d/12M1nPAPPPeLcZDuZvXHoCrF6L9Pg6RUf/view?usp=sharing",
  "work":[
    {
      "title":"Open Vantage",
      "role":"software developer",
      "description":"React Native,Graphql,restfull api's,figma Sint do aute irure enim nulla Lorem fugiat proident enim ullamco elit mollit. Consequat qui non cupidatat aliquip quis laborum laborum in occaecat qui. Laborum Lorem anim eu deserunt aliquip deserunt. Veniam consequat do pariatur velit reprehenderit cillum est ad. Mollit irure commodo id elit deserunt nostrud mollit cupidatat velit incididunt ea.",
      "timeline":"* September 2019 to Currently"
    },
    {
      "title":"Verge Technologies",
      "role":"software developer",
      "description":"React Native,Graphql Aute incididunt velit consequat proident laborum id dolor cupidatat pariatur Lorem ut. Aliqua elit officia elit dolore labore sunt occaecat id. Excepteur incididunt incididunt pariatur Lorem occaecat quis qui laboris fugiat culpa irure consectetur non. Qui dolor nulla fugiat aliqua labore minim irure. Cupidatat proident ut sit commodo deserunt incididunt consectetur est commodo veniam. Deserunt adipisicing deserunt consequat elit. Anim aliqua ea magna laborum elit enim ea sunt aute.",
      "timeline":"* March 2019 to August"
    }
  ],
  "skills":[
    {
      "language":"Javascript",
      "rating":"80"
    },
    {
      "language":"Typescript",
      "rating":"60"
    },
    {
      "language":"CSS",
      "rating":"30"
    }
  ],
  "frameworkSkills":[
    {
      "frameworkTitle":"React",
      "rating":"80"
    },
    {
      "frameworkTitle":"React Native",
      "rating":"90"
    }
  ]
}
